# Executes the following lines to install all my VSCode extensions.
# ---
# To obtain theses output lines, type the following command :
# on Linux : code --list-extensions | xargs -L 1 echo code --install-extension
# on Windows : code --list-extensions | % { "code --install-extension $_" }

code --install-extension acestojanoski.ace-palenight
code --install-extension alexanderte.dainty-material-theme-palenight-vscode
code --install-extension arcticicestudio.nord-visual-studio-code
code --install-extension bachiramiri.7lou-vscode
code --install-extension ban.spellright
code --install-extension brittanychiang.halcyon-vscode
code --install-extension Catppuccin.catppuccin-vsc
code --install-extension daydev.dark-pastels-remix
code --install-extension dnlytras.nord-wave
code --install-extension dsznajder.es7-react-js-snippets
code --install-extension esbenp.prettier-vscode
code --install-extension formulahendry.auto-rename-tag
code --install-extension GitHub.github-vscode-theme
code --install-extension golang.go
code --install-extension Gruntfuggly.todo-tree
code --install-extension marlosirapuan.nord-deep
code --install-extension mflo999.lintel
code --install-extension mgwg.light-pink-theme
code --install-extension mhutchie.git-graph
code --install-extension mikestead.dotenv
code --install-extension ms-dotnettools.csharp
code --install-extension ms-vscode-remote.remote-ssh
code --install-extension ms-vscode-remote.remote-ssh-edit
code --install-extension ms-vscode-remote.remote-wsl
code --install-extension ms-vscode.remote-explorer
code --install-extension MTurek.CodingAdventuresTheme
code --install-extension naumovs.theme-oceanicnext
code --install-extension Shira.pastel-sky-theme
code --install-extension tinkertrain.theme-panda
code --install-extension Tyriar.sort-lines
code --install-extension vscodevim.vim
code --install-extension waderyan.gitblame
code --install-extension wayou.vscode-todo-highlight
code --install-extension whizkydee.material-palenight-theme
